#include <iostream>
using namespace std;

int main() {
	/* 假设现在有这样一个成绩表
	*
	名		语文		数学		英语
	A		100		100		100
	B		90		80		70
	C		60		100		80
	*/
	//我现在想要知道每个人的总成绩

	//首先我们需要创建一个二维数组, 储存这些成绩
	int sorce[3][3] = {
		{100,100,100},
		{90,80,70},
		{60,100,80}
	};

	//创建一个arr, 用于储存名字
	string names[] = { "A", "B", "C" };

	//我们可以把每一行的所有列加起来, 就是总成绩 -> 通过循环进行统计就好
	for (int i = 0; i < 3; i++) {
		//创建一个临时变量, 用于储存总分
		int all = 0;
		for (int j = 0; j < 3; j++) {
			//给all增加, 每次增加的数值是对应的列的值
			all += sorce[i][j];
		}
		//输出就好
		cout << names[i] << " 的总分: " << all << endl;
	}
	return 0;
}